
* Introduction

This is a repo hosting my follow along code and notes from the [[https://github.com/talkpython/100daysofcode-with-python-course][TalkPython course]] 100 days of code with Python.

* Prep

** Outline of methodology and tools

The development is done in Emacs with multi-language Org mode notebooks, from which code is wrangled to separate script files in specified locations as you see. The code is also exported directly to jupyter notebooks.

** Adding the forked course material as a Subtree

/I've used submodules in the past, but apparently subtrees is a better approach for code that I will mostly use as a reference more than anything else. As usual magit helped make things rather simple./

Having a separate repository enables me to setup the project as desired and perhaps add more subtrees for different apps. It may be interesting to combine this notebook with streamlit apps

** Creating a folder directory to work in

#+BEGIN_SRC sh
mkdir -p 01_scripts/
mkdir -p 02_data
mkdir -p 03_notebooks
#+END_SRC


** Creating a virtual environment for this course
Using conda:

#+BEGIN_SRC sh
conda create -n 100dpython
#+END_SRC

Activating the environment:

#+BEGIN_SRC sh
conda activate 100dpython
#+END_SRC

Installing bob's requirements:

#+BEGIN_SRC sh
pip install -r requirements/bob-requirements.txt
#+END_SRC


* Days 1-3
:PROPERTIES:
:header-args: :session 100d01 :results verbatim
:END:

A simple procedure to enter in Christmas as a date and calculate the number of days from today till Christmas.

#+BEGIN_SRC ipython
from datetime import datetime
from datetime import date

datetime.today()
date.today()

type(datetime.today())
type(date.today())

today_date = date.today()

today_date.month

# Defining a date object
christmas_date = date(2019, 12, 25)

# Days until christmas_date
(christmas_date - today_date).days
(christmas_date - today_date)

if christmas_date is not today_date:
    print("There are " + str((christmas_date - today_date).days) + " days left till Christmas")
else:
    print("Today is Christmas")
#+END_SRC

#+RESULTS:
:results:
# Out [2]:
# output
There are 24 days left till Christmas

:end:

** Time delta

#+BEGIN_SRC ipython

#+END_SRC



* Days 4-6
